src/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ФизическиеЛица/Ext/ObjectModule.bsl
Функция ВалидацияПолейФИО(Строка)  
	результатПоиска = СтрНайтиПоРегулярномуВыражению(Строка, "[а-яА-ЯЁё\-]+");
	Возврат результатПоиска.НачальнаяПозиция > 0 И 
		СтрНайтиПоРегулярномуВыражению(Строка, "\-{2}").НачальнаяПозиция = 0;   
КонецФункции   
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = "Неверный формат ввода.";
	
	Если НЕ ВалидацияПолейФИО(Фамилия) Тогда   
		Сообщение.Поле = "Фамилия";     
		Сообщение.УстановитьДанные(ЭтотОбъект);
    	Сообщение.Сообщить();  
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти(Сообщение.Поле));
		Отказ = Истина;
		Возврат;
	КонецЕсли;       
	
	Если НЕ ВалидацияПолейФИО(Имя) Тогда   
		Сообщение.Поле = "Имя";
    	Сообщение.Сообщить();   
		Отказ = Истина;
		Возврат;
	КонецЕсли;       
	
	Если ЗначениеЗаполнено(Отчество) И НЕ ВалидацияПолейФИО(Отчество) Тогда   
		Сообщение.Поле = "Отчество";
    	Сообщение.Сообщить();   
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
КонецПроцедуры
